app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT * FROM "events" ORDER BY date ASC

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("updated_at", "date", "field", "field_layout_updated_at", "field_layout_file_name", "field_layout_content_type", "field_layout_file_size", "created_at") VALUES('2009-11-17 17:32:12', '2010-06-17 17:31:00', 'Mirabel', NULL, NULL, NULL, NULL, '2009-11-17 17:32:12')