app/controllers/games_controller.rb

SELECT * FROM "games"
---
  def index
    @games = Game.all

SELECT * FROM "games" WHERE ("games"."id" = 1)
---
  def show
    @game = Game.find(params[:id])

SELECT * FROM "games" WHERE ("games"."id" = 3)
---
  def edit
    @game = Game.find(params[:id])

INSERT INTO "games" ("event_id", "score_home", "updated_at", "time", "team_home_id", "score_away", "team_away_id", "created_at") VALUES(NULL, NULL, '2009-11-17 17:41:09', '9h00', 2, NULL, 1, '2009-11-17 17:41:09')
---
  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save

SELECT * FROM "games" WHERE ("games"."id" = 3)
UPDATE "games" SET "team_home_id" = 3, "score_away" = NULL, "updated_at" = '2009-11-17 17:57:36' WHERE "id" = 3
---
  def update
    @game = Game.find(params[:id])

    respond_to do |format|
      if @game.update_attributes(params[:game])

SELECT * FROM "games" WHERE ("games"."id" = 1)
DELETE FROM "games" WHERE "id" = 1
---
  def destroy
    @game = Game.find(params[:id])
    @game.destroy