app/controllers/league_posts_controller.rb

SELECT * FROM "league_posts" ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT count(*) AS count_all FROM "league_posts"
---
  def index
    @league_posts = LeaguePost.paginate :page => params[:page], :order => 'created_at DESC',:per_page => 2

SELECT * FROM "league_posts" WHERE ("league_posts"."id" = 1)
---
  def show
    @league_post = LeaguePost.find(params[:id])

SELECT * FROM "league_posts" WHERE ("league_posts"."id" = 3)
---
  def edit
    @league_post = LeaguePost.find(params[:id])

INSERT INTO "league_posts" ("updated_at", "title", "picture_content_type", "description", "picture_file_name", "picture_updated_at", "picture_file_size", "created_at") VALUES('2009-11-11 00:58:47', 'La MIPL prend forme', 'image/png', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Vivamus nec porttitor diam. Praesent ut neque a mi sollicitudin vulputate nec in nisl. Duis nec erat condimentum nisl sodales elementum. Morbi ut nisi a nunc accumsan fringilla sit amet eget metus. Duis vel augue nec libero interdum bibendum id non leo. Pellentesque sit amet tortor id elit pharetra auctor non non erat. In massa lacus, vulputate id posuere ut, posuere eu mi. In vitae metus ac ante facilisis volutpat vel non nunc. Vivamus eu nunc vitae massa congue scelerisque. Morbi euismod lobortis adipiscing. Pellentesque vitae ipsum lectus. Curabitur fringilla euismod posuere. Sed lacus augue, pulvinar ac porttitor at, sollicitudin eget nisi. Maecenas nec leo purus, vitae porta augue. Curabitur vel velit lectus. Nulla mollis nulla ut erat accumsan non semper nisl venenatis. Praesent dapibus rhoncus lorem vel scelerisque.
---
  def create
    @league_post = LeaguePost.new(params[:league_post])

    respond_to do |format|
      if @league_post.save