app/controllers/login_controller.rb

SELECT * FROM "owners" WHERE (username = '' and password = '') LIMIT 1
---
  def login
    flash[:login_error] = nil
    username = params[:username]
    password = params[:passwd]
    session[:is_admin] = false
    if !username.nil? && !password.nil?
      if username == ADMIN_USERNAME && password == ADMIN_PASSWORD
        session[:is_admin] = true
      else
        owner = Owner.find(:first,:conditions => ["username = ? and password = ?",username,password])