app/controllers/owners_controller.rb

  def index
    @owners = Owner.all
---
SELECT * FROM "owners"

  def show
    @owner = Owner.find(params[:id])
---
SELECT * FROM "owners" WHERE ("owners"."id" = 1)

  def edit
    @owner = Owner.find(params[:id])
---
SELECT * FROM "owners" WHERE ("owners"."id" = 1)

  def create
    @owner = Owner.new(params[:owner])

    respond_to do |format|
      if @owner.save
---
INSERT INTO "owners" ("team_id", "updated_at", "username", "firstname", "lastname", "phone", "password", "email", "created_at") VALUES(6, '2009-11-02 03:34:00', 'user1', 'sdfsdf', 'sdfsdf', 'sdfs', '123456', 'dfsdf', '2009-11-02 03:34:00')