app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT * FROM "photos" WHERE (category = 'general') ORDER BY created_at DESC

  def general
    @photos = Photo.find(:all,:order => 'created_at DESC',:conditions => ["category = ?",'general'])
---
SELECT * FROM "photos" WHERE (category = 'general') ORDER BY created_at DESC

  def event1
    @photos = Photo.find(:all,:order => 'created_at DESC',:conditions => ["category = ?",'event1'])
---
SELECT * FROM "photos" WHERE (category = 'event1') ORDER BY created_at DESC

  def event3
    @photos = Photo.find(:all,:order => 'created_at DESC',:conditions => ["category = ?",'event3'])
---
SELECT * FROM "photos" WHERE (category = 'event3') ORDER BY created_at DESC

  def event5
    @photos = Photo.find(:all,:order => 'created_at DESC',:conditions => ["category = ?",'event5'])
---
SELECT * FROM "photos" WHERE (category = 'event5') ORDER BY created_at DESC

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 1)

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 1)

  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("category", "updated_at", "title", "file_content_type", "file_file_name", "file_updated_at", "file_file_size", "created_at") VALUES('general', '2009-11-11 04:16:31', 'Photo 1', 'image/jpeg', 'news1.jpg', '2009-11-11 04:16:30', 313426, '2009-11-11 04:16:31')

  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy
---
SELECT * FROM "photos" WHERE ("photos"."id" = 6)
DELETE FROM "photos" WHERE "id" = 6