app/controllers/players_controller.rb

SELECT * FROM "players" WHERE (team_id = 1)
SELECT * FROM "players"
---
  def index
    @subtitle = ''
    if(is_team_owner?)
      @players = Player.find(:all,:conditions => ["team_id = ?",owner_team.id])
      @subtitle = owner_team.name
    else
      @players = Player.all

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def show
    @player = Player.find(params[:id])

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def edit
    @player = Player.find(params[:id])

INSERT INTO "players" ("team_id", "updated_at", "number", "nickname", "firstname", "lastname", "picture_content_type", "picture_file_name", "picture_updated_at", "picture_file_size", "position", "created_at") VALUES(2, '2009-11-17 03:44:08', 66, 'Lavoie', 'Joel', 'kkk', 'image/jpeg', 'news7.jpg', '2009-11-17 03:44:07', 130692, '', '2009-11-17 03:44:08')
---
  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save

SELECT * FROM "players" WHERE ("players"."id" = 1)
UPDATE "players" SET "position" = 'Back', "picture_file_size" = 265108, "picture_file_name" = 'news6.jpg', "picture_updated_at" = '2009-11-16 01:45:50', "picture_content_type" = 'image/jpeg', "updated_at" = '2009-11-16 01:45:51' WHERE "id" = 1
---
  def update
    @player = Player.find(params[:id])

    respond_to do |format|
      if @player.update_attributes(params[:player])

SELECT * FROM "players" WHERE ("players"."id" = 1)
DELETE FROM "players" WHERE "id" = 1
---
  def destroy
    @player = Player.find(params[:id])
    @player.destroy