app/controllers/sponsors_controller.rb

  def index
    @sponsors = Sponsor.all
---
SELECT * FROM "sponsors"

  def show
    @sponsor = Sponsor.find(params[:id])
---
SELECT * FROM "sponsors" WHERE ("sponsors"."id" = 1)

  def edit
    @sponsor = Sponsor.find(params[:id])
---
SELECT * FROM "sponsors" WHERE ("sponsors"."id" = 1)

  def create
    @sponsor = Sponsor.new(params[:sponsor])

    respond_to do |format|
      if @sponsor.save
---
INSERT INTO "sponsors" ("name", "image_file_size", "updated_at", "image_content_type", "website", "image_updated_at", "created_at", "image_file_name") VALUES('Impact', 7720, '2009-11-19 22:13:02', 'image/png', 'www.impact-proshop.com', '2009-11-19 22:13:02', '2009-11-19 22:13:02', 'impact.png')

  def update
    @sponsor = Sponsor.find(params[:id])

    respond_to do |format|
      if @sponsor.update_attributes(params[:sponsor])
---
SELECT * FROM "sponsors" WHERE ("sponsors"."id" = 1)
UPDATE "sponsors" SET "website" = 'http://www.impact-proshop.com', "updated_at" = '2009-11-19 22:16:03' WHERE "id" = 1