app/controllers/static_controller.rb

SELECT * FROM "sponsors"
---
  def index
    @league_posts = LeaguePost.find(:all,:limit => 4,:order => 'created_at DESC')
    @team_posts = TeamPost.find(:all,:limit => 6,:order => 'created_at DESC')
    @sponsors = Sponsor.all