app/controllers/teams_controller.rb

  def index
    @teams = Team.find(:all).sort {|a,b| b.wins <=> a.wins}
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)

  def show
    @team = Team.find(params[:id])
    @team_posts = TeamPost.paginate :page => params[:page], :order => 'created_at DESC',:per_page => 2,:conditions => ["team_id = ?",@team.id]
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)
SELECT "team_posts".* FROM "team_posts" WHERE ("team_posts".team_id = 1) ORDER BY created_at DESC
SELECT * FROM "teams"
SELECT count(*) AS count_all FROM "team_posts" WHERE (team_id = 1)

  def edit
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 3)

  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("name", "updated_at", "picture_content_type", "wins", "picture_file_name", "picture_updated_at", "picture_file_size", "phone", "loses", "email", "created_at") VALUES('Test', '2009-11-02 02:14:13', 'image/gif', 1, 'CenterImage.gif', '2009-11-02 02:14:12', 34315, 'tt', 1, 'tt', '2009-11-02 02:14:13')

  def update
    @team = Team.find(params[:id])

    respond_to do |format|
      if @team.update_attributes(params[:team])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 6)
UPDATE "teams" SET "picture_file_size" = 32091, "picture_file_name" = 'ShadowForce_300x300_newRed.png', "picture_updated_at" = '2009-11-14 19:41:22', "picture_content_type" = 'image/png', "updated_at" = '2009-11-14 19:41:23' WHERE "id" = 1

  def destroy
    @team = Team.find(params[:id])
    @team.destroy
---
SELECT * FROM "teams" WHERE ("teams"."id" = 1)
DELETE FROM "teams" WHERE "id" = 1