app/controllers/team_posts_controller.rb

SELECT * FROM "team_posts"
---
  def index
    @team_posts = TeamPost.all

SELECT * FROM "team_posts" WHERE ("team_posts"."id" = 1)
---
  def show
    @team_post = TeamPost.find(params[:id])

SELECT * FROM "team_posts" WHERE ("team_posts"."id" = 2)
---
  def edit
    @team_post = TeamPost.find(params[:id])

INSERT INTO "team_posts" ("team_id", "updated_at", "title", "picture_content_type", "description", "picture_file_name", "picture_updated_at", "picture_file_size", "created_at") VALUES(1, '2009-11-16 14:27:22', 'Titre 2', 'image/jpeg', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Praesent pharetra mollis convallis. Suspendisse commodo tortor sit amet sem iaculis sagittis. Duis at tristique felis. Curabitur rhoncus, urna ut vestibulum suscipit, urna odio congue dolor, sagittis accumsan magna arcu ut nulla. Fusce mollis gravida nibh, ac congue nibh venenatis dictum. Sed porta dui urna, id luctus felis. Mauris bibendum pellentesque eros, quis laoreet tortor imperdiet vel. Quisque blandit porta fringilla. Donec eu eros eget urna fermentum gravida. Curabitur eu ipsum lorem, sit amet consequat erat. Praesent condimentum varius arcu at porttitor. Vestibulum rutrum ullamcorper nulla, eu suscipit risus semper vel.
---
  def create
    @team_post = TeamPost.new(params[:team_post])

    respond_to do |format|
      if @team_post.save

SELECT * FROM "team_posts" WHERE ("team_posts"."id" = 1)
DELETE FROM "team_posts" WHERE "id" = 1
---
  def destroy
    team = @team_post.team
    @team_post = TeamPost.find(params[:id])
    @team_post.destroy